Repository: concretecms-community-store/community_store_bcc_payway
Catalog: languages/*/LC_MESSAGES/messages.po
Languages: it_it

source: BCC PayWay Payment Method
it_it: Modalità di paagmento BCC PayWay

source: BCC PayWay Payment Method for Community Store
it_it: Modalità di paagmento BCC PayWay per Community Store

source: We accept the most used credit cards.
it_it: Accettiamo le carte di credito più diffuse.

source: We accept these credit cards:
it_it: Accettiamo queste carte di credito:

source: Environment to be used
it_it: Ambiente da usare

source: URL of the bank services (environment: %s)
it_it: URL dei servizi bancari (ambiente: %s)

source: Terminal ID (environment: %s)
it_it: ID terminale (ambiente: %s)

source: Signature Key (environment: %s)
it_it: Chiave per la firma (ambiente: %s)

source: Credit card images to be displayed
it_it: Immagini delle carte di credito da mostrare

source: Click on the images to disable them, drag them to change the order.
it_it: Fare clic sulle immagini per disabilitarle, trascinarle per cambiarne l’ordine.

source: Payment not possible
it_it: Pagamento non possibile

source: We are sorry: the payment system is not currently available.
it_it: Siamo spiacenti: il sistema di pagamento non è disponibile al moment.

source: Please try again later.
it_it: Riprovare più tardi.

source: Error code: %s
it_it: Codice d’errore: %s

source: Missing parameter: %s
it_it: Parametro mancante: %s

source: '%s' is not a valid/known shopID
it_it: “%s” non è un shopID valido/conosciuto

source: The shopID '%1$s' should be associated to the '%2$s' paymentID, but we received '%3$s'
it_it: Lo shopID “%1$s” dovrebbe essere associato al paymentID “%2$s”, ma abbiamo ricevuto “%3$s”

source: '%s' is not a valid/known terminal ID
it_it: “%s” non è un ID terminale valido/conosciuto

source: Payment failed
it_it: Pagamento fallito

source: We are sorry: the payment did NOT complete successfully.
it_it: Siamo spiacenti: il pagamento NON è stato completato con successo.

source: Click here to return to the checkout page.
it_it: Fare clic qui per tornare alla pagina di checkout.

source: Pay with %s
it_it: Paga con %s

source: Checkout with BCC PayWay
it_it: Paga con BCC PayWay

source: Production
it_it: Produzione

source: Please specify which environment should be used for BCC PayWay
it_it: Specificare quale ambiente usare con BCC PayWay

source: Please specify the URL of the bank services for the %s environment of BCC PayWay
it_it: Specificare l’URL dei servizi bancari per l’ambiente %s di BCC PayWay

source: The URL of the bank services for the %s environment of BCC PayWay is wrong
it_it: L’URL dei servizi bancari per l’ambiente %s di BCC PayWay è errato

source: Please specify the terminal ID for the %s environment of BCC PayWay
it_it: Specificare l’ID del terminale per l’ambiente %s di BCC PayWay

source: Please specify the signature key for the %s environment of BCC PayWay
it_it: Specificare la chiave per la firma per l’ambiente %s di BCC PayWay

source: The currency is not configured, or it has a wrong value
it_it: La valuta non è configurata, oppure ha un valore non valido

source: Order %1$s on %2$s
it_it: Ordine %1$s su %2$s

source: Transaction initialization failed (error code: %s)
it_it: L’inizializzazione della transazione è fallita (codice d’errore: %s)
